## Plan Result (Infrastructure)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_cosmosdb_sql_container.this[&#34;netflow&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_sql_container.this["netflow"] will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name          = "sds-platform-version-reporter"
      + database_name         = "reports"
      + default_ttl           = (known after apply)
      + id                    = (known after apply)
      + name                  = "netflow"
      + partition_key_path    = "/netflow"
      + partition_key_version = 2
      + resource_group_name   = "sds-version-reporter-stg-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }

      + indexing_policy {
          + indexing_mode = "consistent"

          + included_path {
              + path = "/*"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":126,"Program":"tfcmt","SHA1":"","Target":"Infrastructure","Vars":{}} -->